# BendMultiplier Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTrayType..::..BendMultiplier Property
CableTrayType Class See Also
---
Bend multiplier.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double BendMultiplier { get; set; }
```

Visual Basic
---
```text
Public Property BendMultiplier As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BendMultiplier {
	double get ();
	void set (double value);
}
```

# Remarks
This should be positive and less than 3000.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The bend multiplier value should be positive and less than 3000. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace